choices_list = {
    "text": [
        "ФИО", "Фамилия", "Имя", "Отчество", "Логин", "Дата рождения", "Возраст", "Пол",
        "Страна", "Город", "Адрес", "Почтовый индекс", "Email", "Телефон", "Широта", "Долгота",
        "Компания", "Категория продукта", "Должность", "Отдел",
        "Валюта", "Символ валюты", "Кредитная карта", "IBAN",
        "Случайный текст (до 100 букв)", "Заголовок", "Цвет", "Рейтинг (1-5)", "Цена",
        "Пароль", "IP-адрес", "Домен", "URL", "URI",
        "UUID", "Число (большое)", "Число (маленькое)", "True/False", "Случайный хэш", "JSON-объект",
        "Дата", "Время", "Дата и время", "Временная зона", "Дата в прошлом", "Дата в будущем"
    ],
    "character varying": [
        'ФИО', 'Фамилия', 'Имя', 'Отчество', 'Логин', 'Пол',
        'Страна', 'Город', 'Адрес', 'Почтовый индекс', 'Email',
        'Телефон', 'Компания', 'Категория продукта', 'Должность',
        'Отдел', 'Валюта', 'Символ валюты', 'Кредитная карта',
        'IBAN', 'Случайный текст (до 100 букв)', 'Заголовок',
        'Цвет', 'Пароль', 'IP-адрес', 'Домен', 'URL', 'URI',
        'UUID', 'Случайный хэш', 'JSON-объект', 'Временная зона'
    ],
    "uuid": ["UUID"],
    "integer": ["Число (большое)"],
    "smallint": ["Число (маленькое)"],
    "bigint": ["Число (большое)"],
    "boolean": ["True/False"],
    "numeric": [
        "Возраст", "Широта", "Долгота",
        "Рейтинг (1-5)", "Цена"
    ],
    "date": [
        "Дата рождения", "Дата", "Время", "Дата и время",
        "Временная зона", "Дата в прошлом", "Дата в будущем"
    ],
    "timestamp with time zone": [
        'Дата', 'Время', 'Дата и время',
        'Дата в прошлом', 'Дата в будущем'
    ],
    "jsonb": ["JSON-объект", ]
}


